Autodesk.Revit.DB.MultiReferenceAnnotation.GetMultiReferenceAnnotationOptions
Get options for a multi-reference annotation.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotation.SetMultiReferenceAnnotationOptions(Autodesk.Revit.DB.MultiReferenceAnnotationOptions)
Set new options for multi-reference annotation.
options:
The creation options for multi-reference annotation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input 3D view cannot be used to place a MultiReferenceAnnotation object.
-or-
dimension line direction and dimension plane normal are not orthogonal.
-or-
There is at least one element that doesn't match the reference category of the MultiReferenceAnnotationType, or there are no elements.
-or-
for DimensionStyleType LinearFixed dimensions the dimension line direction must be parallel to either the view's vertical or horizontal direction.
-or-
some references can't be used with a DimensionStyleType Linear dimension of this direction.
References must either appear as points in the view or be linear references which are perpendicular to the dimension line.
-or-
some references can't be used with a DimensionStyleType LinearFixed dimension.
Only references which appear as points in the view can be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014